INSERT INTO user (
    us_id, us_pw, us_nickname, us_authority
) VALUES (
    'a',
    '$2a$10$bDSTHew9PH.nHBCWSr4jsOPkPzaVX1ycgScYXCSSD9Q0krcB9kd2q',
    '테스트유저',
    'USER');
    
INSERT INTO user_asset (as_us_num, as_type, as_asset_type, as_currency, as_amount, as_won, as_expected_return, as_created) VALUES
   (1, '1', '현금 (원)', 'KRW', 5000000, 0, 1, NOW()),
   (1, '2', '현금 (달러)', 'USD', 4000, 0, 1, NOW()),
   (1, '3', '예적금', 'KRW', 10000000, 0, 1.025, NOW()),
   (1, '4', '채권', 'KRW', 7000000, 0, 1.04, NOW()),
   (1, '5', '금', 'GLD', 13, 0, 1.0853, NOW()),
   (1, '6', 'S&P 500', 'VOO', 8, 0, 1.07998, NOW());
   
INSERT INTO user_asset_target (ta_us_num, ta_as_num, ta_target_percent, ta_end_date) VALUES
   (1, 1, 14, '2025-09-02'),
   (1, 2, 15, '2025-09-02'),
   (1, 3, 16, '2025-09-02'),
   (1, 4, 17, '2025-09-02'),
   (1, 5, 18, '2025-09-02'),
   (1, 6, 20, '2025-09-02');

INSERT INTO asset_type_score (at_as_num, at_name, at_mdd, at_score, at_expected_return) VALUES
   (1, '현금 (원)', 0, 0, 0),
   (2, '현금 (달러)', 0, 0, 0),
   (3, '예적금', 0, 0, 2.5),
   (4, '채권', 0, 0, 0),
   (5, '금', 45.49, 4.549, 0),
   (6, 'S&P 500', 53.14, 5.314, 0);
   
INSERT INTO cpi_data (cpi_year, cpi_change_rate, cpi_interest_rate, cpi_real_interest_rate) VALUES
   (1999, 0.8, 4.75, 3.95),
   (2000, 2.3, 5.087, 2.787),
   (2001, 4.1, 4.428, 0.328),
   (2002, 2.8, 4.25, 1.45),
   (2003, 3.5, 3.782, 0.282),
   (2004, 3.6, 3.304, -0.296),
   (2005, 2.8, 3.63, 0.83),
   (2006, 2.2, 4.355, 2.155),
   (2007, 2.5, 4.982, 2.482),
   (2008, 4.7, 4.455, -0.245),
   (2009, 2.8, 2.031, -0.769),
   (2010, 2.9, 2.237, -0.663),
   (2011, 4.0, 3.157, 0.843),
   (2012, 2.2, 2.826, 0.626),
   (2013, 1.3, 2.5, 1.2),
   (2014, 1.3, 2.074, 0.774),
   (2015, 0.7, 1.55, 0.85),
   (2016, 1.0, 1.25, 0.25),
   (2017, 1.9, 1.5, -0.4),
   (2018, 1.5, 1.75, 0.25),
   (2019, 0.4, 1.343, 0.943),
   (2020, 0.5, 0.534, 0.034),
   (2021, 2.5, 0.839, 1.661),
   (2022, 5.1, 2.109, -2.991),
   (2023, 3.6, 3.5, -0.1),
   (2024, 2.3, 3.146, 0.846);